no = нет
user-info =
    Имя: { $name }
    Username: { $username }
    #id{ NUMBER($id, useGrouping: 0) }
user-banned = ID { NUMBER($id, useGrouping: 0) } добавлен в список заблокированных. При попытке отправить сообщение пользователь получит уведомление о том, что заблокирован.
user-shadowbanned = ID { NUMBER($id, useGrouping: 0) } добавлен в список скрытно заблокированных. При попытке отправить сообщение пользователь не узнает, что заблокирован.
user-unbanned = ID { NUMBER($id, useGrouping: 0) } разблокирован.

no-banned = Нет заблокированных пользователей.
list-banned-title = Список заблокированных:
list-shadowbanned-title = Список скрытно заблокированных:

sent-confirmation = Сообщение отправлено!

intro =
    Привет ✌️!
    Для связи с Павлом Paperclip! Просто напиши что-нибудь в этот диалог, видео картинки музыку итд я тоже принимаю, а когда закончишь напиши /cancel.

help =
    🤖НАСТЯ - ВАШ ПОМОЩНИК В СЕТИ!

    Проекты участия:
    Нейронка Каждый День
    Paperfunk Chat
    PPRFNK Технократы

    Безопасность:
    🚫Если заметили нарушителя, дайте знать: /report.
    ❌Отменить действие: /cancel.

    Общение:
    Хотите задать вопрос? Обращайтесь: @naastyyaabot.

    🎨DaLLE2:
    Нарисуй: ....

    🌌Stable Diffusio (SD):
    Представь: ....

    🌠Midjourney:
    Отобрази: ...
    Ожидайте примерно 3 минуты. После этого будут представлены 4 варианта изображения, один из которых вы сможете увеличить для лучшего просмотра.

    Автор: @vistee, Помогал: @paperclipdnb
